Catalogs/ТоварныеГруппыПеревозчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ТоварныеГруппыПеревозчиков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТоварныеГруппыПеревозчиков/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ДействияФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запр.УстановитьПараметр("Владелец", Объект.Владелец);
    Запр.Текст = "ВЫБРАТЬ
                 |	ТоварныеГруппыПеревозчиковТовары.Номенклатура КАК Номенклатура
                 |ИЗ
                 |	Справочник.ТоварныеГруппыПеревозчиков.Товары КАК ТоварныеГруппыПеревозчиковТовары
                 |ГДЕ
                 |	ТоварныеГруппыПеревозчиковТовары.Ссылка <> &Ссылка
                 //|	И НЕ ТоварныеГруппыПеревозчиковТовары.Ссылка.ПометкаУдаления
                 |	И ТоварныеГруппыПеревозчиковТовары.Ссылка.Владелец = &Владелец";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоменклатураПеревозчика.Добавить(Выборка.Номенклатура);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура Подбор(Команда)
	
	Номенклатура = Новый СписокЗначений;
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		Номенклатура.Добавить(СтрокаТЧ.Номенклатура);	
	КонецЦикла;

	///Создаем структуру с отбором и добавляем значения
	ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Товары"));
	//ПараметрыОтбора.Вставить("Дата", ТекущаяДата());   ///Дополнительный отбор
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); ///Добавляем отбор в параметры формы

	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("НеактуальнаяНоменклатура", Номенклатура);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма, "Подбор");

	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы", 
					ПараметрыФормы, 
					ЭтаФорма, , , , 
					ОбработкаВыбора); 

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
	
	//Если Значение = Неопределено Тогда
	//    Возврат;
	//КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Для каждого Эл Из ВыбранноеЗначение Цикл   
		НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Эл));
		Если НайдСтроки.ВГраница() = -1 Тогда
			НовСтрока = Объект.Товары.Добавить();
			НовСтрока.Номенклатура = Эл; 
			Модифицированность = Истина;
		Иначе	
			клНамекнуть("Добавление группы", "Группа " + Эл + " уже выбрана", БиблиотекаКартинок.ДиалогВосклицание);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
